public class Main {
  public static void main(String[] args) {
    DecryptTrivial decryptTrivial = new DecryptTrivial();
    String decryptedString_1 = "בכ‏םרז ÿגפגם, בי¸ןם¸ז ÿט‎ב¸י¸םכÿ¸פ! מןכטחךנטמü מ ו‎ב‎פגז," + "חכאב‎ ך‎ ÿרעכבג ךגזםכךך‎ü מגןש בכטהך‎ ÿרב‎ÿ‎ןש ךג ןכטשחכ חט‎ממ" + "(חט‎ממ¸ס¸ח‎ף¸ü) ¸ ךג לםכמןכ פ¸מטכ (םגאםגממ¸ü). ך‎ ÿרעכבג ךנהךכ ÿכוÿם‎צ‎ןש x," + "y, width, height ¸ חט‎ממ כ‏ך‎םנהגךךכאכ ך‎ ח‎םן¸ךחג כ‏קגחן‎ (¸ט¸ חככםב¸ך‎ןר" + "ןכפגח חכךןנםכÿ תןכאכ כ‏קגחן‎, ‎-טü מגאיגךן‎ף¸ü).";
    String decryptedString_2 = "‎חתיפד ‎‏זץ. חיüשזגבשכחיפ הליךחû טי‏‎וחאגוג כ‏¸פ טיח‏הכחû" + "טח הליךל ai, חזג û שככשנ‏. צכח ז‏חתרבשכ‏וץזפ‏ כ‏¸פ, ûפ ¸חא‏כ‏" + "ûפתישכץ וקתלק ךûחק.";
    String decryptedString_3 = "חנלצפלם ¸ןהחלנלפע¸לû, חטסא חעופÿם. נÿ ץ ¸הנל וטץטחע¸הןל ףע" + "מקפץק פעץה מעוהןאצ. ףעןסעתטססעם ףפעזפהננÿ נסט סהםצל סט קחהןעץא, ןלüא" + "צעןאמע מפהצמלם ףןהס מקפץה:";
    String decryptedString_4 = "חעופÿם חטסא. ¸ע ¸ןעךטסלל סהüט מעננטפûטץמעט ףפטחןעךטסלט ףע" + "ףעמעףלםסענק עוץןקךל¸הסלג. ה צהמךט ץףלץעמ ףפטחעץצה¸ןדטנÿש סהנל קץןקז." + "וקחטנ פהחÿ חהןאסטםüטנק ףןעחעצ¸עפסענק ץעצפקחסלûטץצ¸ק!";
    String decryptedString_5 = "סüמ‏üע בא‏ü. מבסיאע סüמ‏ט ‎ע‏ערצûבאי ךאüא גםקש ûם ÿע‏ןע‏." + "ךאü סשל םûûט ן ךשערא‏צרב ü‎צÿםûצע ûüתעûרשםאב‏ט ûםסü ץםאלûבאי.";
    String decryptedString_6 = "ףןüכם‎‏םÿץ‏נ, ןרפ‏üפץ! רנשך ףתםÿ‏ שכ‏כקחך ‎נüמננםשכ. ך" + "ךםקךי‎ח תאפגפכקחשזר ûüנן‎‏כםפ‏נקנרצüÿûשתץ ûüתפףםתן‎‏םנששתקתמפ‎‏פדנ‎צתץ צתרûכשפפ. ףכשפרכנר‎ך ûת‎‏כםצכרפûת ימÿ üת‎‎פפ.";
    String decryptedString_7 = "ע‎ןÿיר עףüך. נ‎ ‏ףÿניה samsung ai ‏ÿ‎נ‎עקב עתם üמ 10ס‎ ûמאבףÿ" + "שתמאא נ ûסג. ";
    String decryptedString_8 = "משכû¸פ לןגןû, מקף‎ûףפ לצךמףקףûשלףג! תשמüץךסף‎ן, ץשםמך ‏" + "רךü כ‏מן‎ üצןמ‏טהןן עךרי‎ףן?";
    String decryptedString_9 = "משכû¸פ מןרז. לךד תשג‎של¸פ יהףץ ךץ‎ףלףûשלךצף.";
    String decryptedString_10 = "קגפהמ‎ קרבן, זץףתףראמ‎ ‏ÿüרב¸ ! ץ דהגקגÿתרבüר בףכרצג ו ץףאü" + "קüףÿגצף- בףדהףץÿעס בףכר דהרקÿגתרבüר דג דגק‏ÿסךרבüס üב¸רהבר¸ף קÿע ץףכר‎" + "גהצףבüûףיüü!";


    String alphabet = "אבגדהו¸זחטיךכלםמןנסעףפץצקרשתûü‎‏ÿ";

    decryptTrivial.substitutionDecrypt(alphabet, decryptedString_10);
//    1. Ñהגטד = 30
//    2. Ñהגטד = 26
//    3. Ñהגטד = 4
//    4. Ñהגטד = 4
//    5. Ñהגטד = 14
//    6. Ñהגטד = 12
//    7. Ñהגטד = 15
//    8. Ñהגטד = 11 המבנûי גוקונ, הלטענטי גכאהטלטנמגטק! ןמהסךאזטעו, ךמדהא ףםאס בףהוע סכוהף‏שוו חאםÿעטו?
//    9. Ñהגטד = 11 המבנûי הוםü. גאר ןמקעמגûי ÿשטך אךעטגטנמגאכט.
//    10. Ñהגטד = 20 המבנûי הוםü, ףגאזאולûי ךכטוםע ! ג ןנמהמכזוםטו םארודמ ס גאלטהטאכמדא- םאןנאגכÿ‏ םארו ןנוהכמזוםטו ןמ ןמהךכ‏קוםט‏ טםעונםועא הכÿ גארוימנדאםטחאצטט!

  }
}